INCOMING STAGE INFRASTRUCTURE CHANGES:`
#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/landon/github-actions-iac-demo_stage/runs/run-dgNxWczNYujV7dmR

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_s3_bucket.test_bucket: Refreshing state... [id=default-github-actions-iac-demo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.test_bucket must be replaced
-/+ resource "aws_s3_bucket" "test_bucket" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::default-github-actions-iac-demo" -> (known after apply)
      ~ bucket                      = "default-github-actions-iac-demo" -> "stage-github-actions-iac-demo" # forces replacement
      ~ bucket_domain_name          = "default-github-actions-iac-demo.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "default-github-actions-iac-demo.s3.us-west-1.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z2F56UZL2M1ACD" -> (known after apply)
      ~ id                          = "default-github-actions-iac-demo" -> (known after apply)
      ~ region                      = "us-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          ~ "Environment" = "default" -> "stage"
            # (1 unchanged element hidden)
        }
      ~ tags_all                    = {
          ~ "Environment" = "default" -> "stage"
            # (1 unchanged element hidden)
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

</details>

*Pusher: @landonnewberry, Action: `pull_request`*